tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Mac App Store
brew "mas"

# cask
## Utility apps
cask "google-chrome"
cask "google-japanese-ime"          # IME
cask "karabiner-elements"           # Keyboard customizer
cask "appcleaner"                   # Utility for delete apps
cask "logi-options+"                # Mouse config
cask "raycast"                      # launcher and clipboard
cask "daisydisk"                    # disk diagnose


## apps for code
cask "docker"                       # Virtual development environment
cask "iterm2"                       # Enhanced terminal
cask "visual-studio-code"           # Text editor
cask "utm"                          # virtual machine
cask "wireshark"                    # network monitoring
cask "raspberry-pi-imager"          # raspberry pi sd card



## other creative apps
cask "touchdesigner"                # creative coding / VJ
cask "blender"                      # 3d modeling animation
cask "davinci resolve studio"       # 3d modeling animation
cask "epic-games"                   # unreal engine
cask "unity"                        # game engine
cask "openframeworks"               # openframeworks


# Mac app store
mas "Xcode", id:497799835           # Mac dev tool
mas "Yoink", id:457622435           # Enhanced copy and paste
mas "Logic Pro", id:634148309       # Music
mas "djay Pro", id:450527929        # DJ


#Dacinci and Houdini have to install manual